{
  "backend/main.mo": "Motoko actor implementing the MediClear backend with CRUD operations for medical report records, including submit, getSummary, getHistory, toggleBookmark, and deleteReport functions using an in-memory Map store.",
  "feature_evidence.json": "Feature evidence report confirming that the app logo replacement (using app-logo.dim_256x256.png) was implemented in AppHeader.tsx and SplashScreen.tsx with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, serving as a reference index for the MediClear app's frontend codebase.",
  "frontend/index.css": "Minimal Tailwind CSS entry file that defines OKLCH-based CSS custom properties for light and dark color themes used throughout the app.",
  "frontend/index.html": "HTML entry point for the MediClear PWA with mobile viewport settings, theme color, apple-mobile-web-app meta tags, and font preconnect links.",
  "frontend/src/App.tsx": "Sets up TanStack Router with four routes (splash, input, results, history) and a root layout that includes a Sonner Toaster for global toast notifications.",
  "frontend/src/components/layout/AppHeader.tsx": "Sticky app header component with the MediClear logo image, dynamic title, and conditional back/history/new navigation buttons styled with a gradient.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper that composes AppHeader with a flexible main content area, supporting optional header visibility and consistent mobile padding.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an authenticated or anonymous ICP actor, invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useFontSize.ts": "Custom hook managing a small/medium/large font size preference persisted in localStorage, returning the current size, setter, and Tailwind CSS class maps.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing DFINITY AuthClient login, logout, and identity state across the app.",
  "frontend/src/hooks/useLanguage.ts": "Custom React hook that manages the app's UI language, persisting the selection to localStorage and exposing the current translation object.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for all backend interactions: fetching history, fetching a single summary, submitting reports, toggling bookmarks, and deleting reports.",
  "frontend/src/i18n/translations.ts": "Defines the Translations interface and a full translations record for six languages (en, hi, es, fr, ar, bn) covering all UI strings in the app.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, defines CSS custom properties for light/dark medical teal-green themes, and adds utility/component classes and animations.",
  "frontend/src/lib/medicalSimplifier.ts": "Contains a large medical-term glossary and utility logic to translate medical jargon into plain-language equivalents for patient-facing report simplification.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query, Internet Identity, and the root App component.",
  "frontend/src/pages/HistoryScreen.tsx": "History page component that lists past reports with search, favourites filtering, delete confirmation dialogs, and navigation to individual report views.",
  "frontend/src/pages/InputScreen.tsx": "React page that provides two textarea inputs for pasting lab reports and prescriptions, runs client-side simplification, submits the result via a mutation, and navigates to the results screen.",
  "frontend/src/pages/ResultsScreen.tsx": "React page that fetches and displays a simplified medical summary (key findings, medications, action steps) with tabs, multi-language support, bookmark/copy/share functionality, and persists original input texts via localStorage.",
  "frontend/src/pages/SplashScreen.tsx": "Animated splash screen shown on app launch that displays the MediClear logo and branding, then auto-navigates to the input screen after ~2.8 seconds.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color tokens (using oklch), typography, border radius, font families, and enabling dark mode, typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata tracking MediClear's version, existing features, and a pending action request (AR-1) to replace the app logo with a newly uploaded image."
}