{
  "backend/main.mo": "Motoko actor defining the backend canister with types for medical reports and simplified summaries, and three public functions: submitReport (stores a new report), getSummary (retrieves a summary by ID), and getHistory (returns all reports in reverse-chronological order).",
  "feature_evidence.json": "Feature evidence report mapping implemented features (mobile-first UI, input screen, results screen with i18n, history screen) to their source files, component dependencies, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence descriptions of each frontend source file, serving as a reference summary for the MediClear app's frontend codebase.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, card, chart, and sidebar tokens.",
  "frontend/index.html": "HTML entry point for the MediClear PWA with mobile-optimized viewport, theme color, Apple web app meta tags, and a root div mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with four routes (splash /, input, results/:reportId, history) and exports the RouterProvider-wrapped App component.",
  "frontend/src/components/layout/AppHeader.tsx": "Sticky app header component with the MediClear logo, optional dynamic title, and conditional back/history/new navigation buttons styled with a gradient.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper that composes AppHeader with a flexible main content area, applying consistent mobile padding and max-width container to all screens.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using TanStack Query, supporting both anonymous and authenticated (Internet Identity) configurations, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useLanguage.ts": "Custom hook that manages the app's selected language, persisting the choice to localStorage and returning the corresponding translation object.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching report history, fetching a single summary, and submitting a new report via the backend actor.",
  "frontend/src/i18n/translations.ts": "Defines the Translations interface and a full translations record for six languages (en, hi, es, fr, ar, bn) covering all UI strings in the app.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind base/components/utilities, defines CSS custom properties for a medical teal-green color palette (light and dark), and declares animation keyframes and utility classes.",
  "frontend/src/lib/medicalSimplifier.ts": "Contains a comprehensive medical glossary mapping clinical jargon to plain-language equivalents, used to simplify medical reports and lab values for patients.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/HistoryScreen.tsx": "Page component that displays a sorted list of past medical reports fetched via useGetHistory, with loading skeletons, error handling, and navigation to individual report views.",
  "frontend/src/pages/InputScreen.tsx": "Input page where users paste a lab report and/or prescription into two separate text areas, then submit to trigger client-side simplification and navigate to the results screen.",
  "frontend/src/pages/ResultsScreen.tsx": "Results page that fetches and displays a simplified medical summary (key findings, medications, action steps) with a language selector for multilingual rendering and a copy-to-clipboard button.",
  "frontend/src/pages/SplashScreen.tsx": "Animated splash screen shown on app launch that displays the MediClear logo and branding, then auto-navigates to the input screen after ~2.8 seconds.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the design system: custom OKLCH-based color tokens, extended border radii, font families (Inter/Nunito), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state manifest describing the MediClear app's purpose, architecture notes, implemented features, and image asset requirements for the logo and splash screen background."
}